export const lang = {
	//公共翻译
	common: {
		你好世界: "你好世界",
		选择单个日期: "选择单个日期",

		你好: "你好",
		欢迎来到: "欢迎来到",
	},
	home: {
		"热门游戏": "热门游戏",
		"收藏游戏": "收藏游戏",
		更多: "更多",
		我们的游戏: "我们的游戏"
	},
	layout: {
		优惠: "优惠",
		记录: "记录",
		首页: "首页",
		钱包: "钱包",
		我的: "我的",
	},
	navBar: {
		注册: "注 册",
		登录: "登 录",
	},
	menuPopup: {
		中文: "中文",
		客服: "客服",
		任务: "任务",
		转盘: "转盘",
	},

	register: {
		登录: "登录",
		注册: "注册",
		输入账号: "输入账号",
		登录密码: "登录密码",
		确认登录密码: "确认登录密码",
		选择主货币: "选择主货币",
		输入推荐码: "输入推荐码",
		"推荐码(非必填)": "推荐码(非必填)",
		我同意用户协议并确认我已年满18岁: "我同意{text}并确认我已年满18岁 ",
		用户协议: "用户协议",
		"我同意接收[平台名称]的营销促销信息": "我同意接收{text}的营销促销信息 ",
		"已有账户？": "已有账户？",
		请同意我们的用户协议: "请同意我们的用户协议",
		"请输入4-11位字母+数字组成，首位必须是字母": "请输入4-11位字母+数字组成，首位必须是字母",
		"密码为8-16位": "密码为8-16位，必须包含数字和字母，可包含@ _ $",
		两次输入密码不一致: "两次输入密码不一致",
		请选择: "请选择",
		请确定已阅读用户协议: "请确定已阅读用户协议",
	},

	login: {
		登录: "登录",
		账户名: "账户名",
		登录密码: "登录密码",
		记住密码: "记住密码",
		忘记密码: "忘记密码？",
		新用户: "新用户？",
		创建账户: " 创建账户 ",
		联系客服: " 联系客服 ",
	},
};
